common/models/User.php

SELECT * FROM `users` WHERE `id`=1
---
    public static function findIdentity($id)
    {
        return self::findOne($id);

SELECT * FROM `users` WHERE `username`='aditya'
---
    public static function findByUsername($username)
    {
        return self::find()->andWhere(['username'=>$username])->one();